
//! операторы (оператор-встроенная функция)

// let a, b; //? оператор запятая
// a = 10;
// b = a; //? оператор присваивания
// let c = a + b; //? оператор сложения +
// console.log(c); //? 20 (10 + 10)

// a = 10; //? а и 10 это операнды(аргументы), левый и правый, т.е. left hand и right hand

// function = (переменная, выражение) { //?внутренняя функция
//     1. Получение результата выражения
//     2. Поиск переменной по имени
//     3. Присваивание результата выражения переменной
//     4. Возврат результата выражения
// }

// 'number' === 'number'; // true
// typeof isUndefined === 'undefined'; // true

// ! данный опертор чаще всего используется в условных инструкциях

// !10; // false Отрицание
// !0; // true
// !'abs'; // true
// !''; // false
// !true; // false
// !undefined; // true

// !!10 // true //! Отпицание отрицания
// !!0 // false
// !!'abs' // true
// !!'' // false
// !!true // true
// !!undefined // false

// && оператор “И” || оператор “ИЛИ” являются операторами короткого замыкания

// выражени 1 && выражени 2; Если выражение 1 ложно, то выражение 2 не выполняется (игнорируется)
// возвращается результат выражения 1

// выражение 1 || выражение2; Если выражение 1 истинно, то выражение 2 не выполняется (игнорируется)
// возвращается результат выражения 1

// 'Valery' || 'Defolt value  '; // Valery
// '' || 'Defolt value  '; // Defolt value
// abc || 'Defolt value  '; // error

// let b = 10;
// b && console.log('Выполнено'); // Выполнено (в браузере будет выведено undefined - метод log)
// let c;
// c && console.log('Выполнено'); // Ничего не выведется (undefined)

// ! цепочка операторов && ||

// a && b && c && d //? если а ложно, остановка, если истино, то продолжается выполнение, до ложного оператора и возвращаем результат
// a || b || c || d //? тоже самое, только наоборот ищет истинное значение

//! оператор разделения объекта на свойство ... (три точки)

// const button = { //? если у объекта уже есть определенное значение оно будет перезаписано (разделение)
// 	widht: 200,
// 	text: 'Hello',
// };

// const redButton = {
// 	...button,
// 	color: 'red',
// };

// console.table(redButton)

// const buttonInfo {
//     text: 'Hello',
// }

// const buttonStyle = {
//     color: 'red',
//     widht: 200,
//     height: 100,
// }

// const button { //? объединение
//     ...buttonInfo,
//     ...buttonStyle,
// }

// console.table(button)