// ! Области видимости

// let a; // todo глобальные переменные
// let b;

function myFn () {
  let b; // ? локальная переменная
  a = true; // ? а не объявлена в зоне видимости функции, и данное значение присвается глобальной а
  b = 10;
  console.log(b); // ? область видимости функции
}

console.log(myFn()); // ? все описанное глобальная область видимости (вызов функции)

console.log(a); //? из области видимости функции (true)
console.log(b); //! выведет 10 undefined true undefined (undefined)

const a = 5; // note глобальная
function myFn () {
  //? область видимости для вложенной функции
  function innerFn () {
    //? внутренняя функция
    console.log(a);
  }
  innerFn(); // note не имеет глобальной области видимости, и может быть вызвана только внутри
}
myFn(); // ? все это цепочка видимости, данная функция должна вернуть undefined

// todo не рекомендуется!

function myFn () {
  a = true; //? переменная объявлена автоматически в глобальной области видимости
  console.log(a);
}
myFn();
console.log(a);
